{
    "Stage": "1-22",
    "Dialogue": [
        {
            "Narrator": "The discussion went on a while, with you understanding nothing. They were using a bunch of new words.",

            "Me": "Are they still using the same language as I do?"
        },
        {
            "Narrator": ["You can feel your legs ache, your brain seemingly exhausted from listening.",

            "You are lost in thought. Your head feels empty.",

            "Then, a voice of the king woke you up, and you looked around to see what had happened.",

            "And there, you saw the President speaking, his voice echoing throughout the room."],
            
            "Frederick of Masons": ["…And with the existence of the Outsider, and the ongoing rumors, I hereby declare Beatrice and company’s testimony legitimate.", "The Outsider, being the sole survivor of the goblin’s summoning, he will be put into house arrest.", "HOWEVER—",

            "As the Outsider lacks citizenship, has no residence and has no known records whatsoever, he will be granted asylum after interrogation from the Investigations Bureau.", "Therefore, before granting asylum, the Outsider will be under the Investigations Bureau’s custody."]
        },
        {
            "Narrator": ["With the gavel slammed against the sound block, the meeting ended just like that.",

            "Everyone stood up from their seats and began having a conversation with each other. ", "Meanwhile, you were pulled by Beatrice and left the room with Charlotte.", "The three of you moved to a more secluded place, the backyard, currently sitting on a bench together.",

            "Beatrice talked first."], 
            
            "Beatrice": "Sorry, {{Name}}, I can’t help you regarding your identity. You lack records, after all. To their eyes, you’re an immigrant.",

            "Me": "It’s fine, as long as I don’t die…"
        },
        {
            "Narrator": "You laughed awkwardly while expecting Beatrice’s response, and she gave none.",
            
            "Me": "Erm… am I gonna die in there?",

            "Beatrice": "N-No, it’s just that… it will be unpleasant."
        },
        {
            "Me": "How unpleasant it could be?",

            "Narrator": ["As Beatrice was about to answer, two individuals approached you.", "They wear a typical tuxedo suit.",
            "One of them spoke to you with a solemn voice."],

            "Matthew": "Greetings, ladies and a gentleman. We are Matthew and Marshall, a team from the Investigation Bureau. We are taking the Outsider into custody."
        },
        {
            "Narrator": "You stood up and looked at the ladies, and sighed.",
            
            "Me": "Well, see you next time, I guess…"
        },      
        {
            "Narrator": ["The investigation team walked away.", "And as you followed suit, you saw Charlotte comforting the clearly disturbed Beatrice."],
            
            "Me": "Is it that bad?"
        },
        {
            "Narrator": ["The three of you left the Palace and went to the Investigation Bureau Headquarters with a carriage.", "It is a building with medieval architecture, similar to a hub.", "Upon arriving, the three of you stayed in a room, where the team immediately began asking questions."],

            "Matthew": "Outsider, we’re not here to interrogate about the event yesterday. We’re just asking you about your personal information. Tell me your name.",

            "Me": "{{Name}}."
        },
        {
            "Matthew": "Gender.",

            "Me": "Male.",
            
            "Narrator": ["The interrogation went on with Matthew asking questions and Marshall writing every detail.", "It went well, at least, in your opinion.", "They have not second-guessed your answers, after all.",

            "Afterwards, Marshall and Matthew brought you to an asylum.", "After going places to places, you begin to feel tired."]
        }
    ]
}