{
    "Stage": "1-17",
    "Dialogue": [
        {
            "Narrator": ["From a slumber, you woke up.",

            "Opening your eyes, you found yourself lying on a bed, facing under the bed railings. The light from the morning sun.",

            "You pondered and thought. This is your first morning in another world.",

            "Everything that happened earlier is not a dream.",

            "You yawned as you raised and stretched your body.",

            "And as your eyes glanced at the space of the room, you noticed two ladies having breakfast.",

            "Fried eggs, bread, and dried fish are prepared on the table.",

            "But then, you saw the greatest crime in eating etiquette. Both of them are wearing their uniforms."],

            "Me": ["Y-You two…", "You two are wearing your outfits while eating?"]
        },
        {
            "Narrator": "The two women stopped the meal they were eating and looked at each other, dumbfounded.",

            "Charlotte": "What are you talking about? Do you want us to eat naked?"
        },
        {
            "Me": ["NO!", "Rather, why are you wearing your casual clothes? Wouldn't it be pajamas or any outfit indoors?"],

            "Charlotte": "Well… we just use our outfit in every scenario"
        },
        {
            "Me": "Urgh, you guys gotta be stinky as hell",

            "Narrator": "Charlotte jolted from her seat, her face flustered.",
            
            "Charlotte": "W-What are you saying?!! Beatrice and I cleansed ourselves everyday!"
        },
        {
            "Me": "You guys use magic even for hygiene?",

            "Narrator": "You looked at Beatrice, expecting an answer from her, her face flustered as well. She simply nodded."
        },
        {
            "Me": "Well…that's something",

            "Narrator": ["As you contemplated the way of living of humanity in this world, you heard a grating sound.",

            "The one who caused the sound, Beatrice, spoke."],
            
            "Beatrice": "Anyways, have a seat…"
        },
        {
            "Me": "Not gonna lie, I’m still not used to this world",

            "Beatrice": "Worry about it later…just join us for breakfast"
        },
        {
            "Me": "Sure… I’m hungry anyways",

            "Narrator": "You sat on the remaining seat, facing both Beatrice and Charlotte."
            
        },
        {
            "Me": "Fried eggs, bread, and dried fish…what a sad meal in the good morning. It almost put me into tears.",

            "Beatrice": "Hey now, no complaining about food. Just be thankful that we have something to eat"
        },
        {
            "Me": "Yeah, I think so. I'm thankful we have something to eat at all.",

            "Narrator": "Charlotte stifled a laugh.",
            
            "Charlotte": "Why are you acting like we're struggling in life? I can't—!"
        },
        {
            "Narrator": ["Charlotte gave in and burst out laughing.",

            "Beatrice followed suit, laughing in a meek giggle. All you can do is just make a smirk."],

            "Me": "Well, since things are lively, bon appetit."
        },
        {
            "Narrator": ["You took the bread and then sliced it in half.", "You stuffed an egg in between and started munching it."], 
            
            "Me": "Now, this is something."
        },
        {
            "Narrator": "And just like that, the three of you had breakfast. A peaceful time, the light from the sun brightened the room, and the sound of conversation made it lively."
        }
    ]
}