{
    "Stage": "1-11",
    "Dialogue": [
        {
            "": "You followed Beatrice and Charlotte in the area where the said airboat is located. As you arrived, you immediately noticed the wreckage and the casualties from the battle these two women started.",

            "Me": "Man, I swear to never piss off these women,"
        },
        {
            "": "You approached two of them, currently casting some spells on the boat.",

            "Me": "They can even do maintenance. This world is sure cruel to me." 
        },
        { 
            "": "After a while, Beatrice and Charlotte stopped their \"maintenance\" and Beatrice approached you.",

            "Beatrice": "The maintenance of the airboat is done. Let's commence forth, shall we?",

            "Me": "Commence forth, you say..." 
        },
        {
            "": ["You blurted out with a laugh.",

            "Beatrice, clearly confused, scratched her cheek."],
    
            "Beatrice": "H-How am I supposed to say it then...",

            "Me": "...Nah, it's just my mumbling. Let's go!" 
        },
        {
            "": "Beatrice chuckled.",
    
            "Beatrice": "You're such a good jester",

            "Me": "Who says 'jester' in this day and age..."
        },
        {
            "Beatrice": "Hmph! I cannot tell anymore if you're doing a jest or not!",

            "Me": "As I said...",

            "": "Charlotte, who got into the boat first and was sitting at the third seat, shouted at them.",
            
            "Charlotte": "Get in, you two!"
        },
        {
            "": ["You and Beatrice approached the airboat. Beatrice got in and sat at the first seat.",

            "And you, looking at them with trust, could only sigh and accept defeat."],
        
            "Me": "Okay fine, this is it." 
        },
        {
            "Narrator": "You got in the boat and sat in the second seat. As soon as you laid down, the airboat suddenly elevated as a magic barrier was cast around the seat, which caused you to panic.",

            "Me": "W-What the hell is this??!!!"
        },
        {
            "Narrator": "Charlotte behind you, tapped your shoulder.",
            
            "Charlotte": "It's alright, we're just gonna elevate to the sky"
        },
        {
            "Narrator": ["The airboat kept on elevating until it went up through the sky. And as soon as it hovers over the clouds, you are mesmerized by the view of the sky.",

            "The sun that was about to descend beneath the horizon of the endless clouds. It illuminated among the clouds, giving them the hue of husk.",

            "And among the clouds, there are more boats and ships floating. You picked out their resemblance to the medieval ships and boats.",

            "Nevertheless, the airboat you rode began moving."],

            "Me": "Are we in the Age of Discovery?"
        },
        {  
            "Beatrice": "Age of Discovery? How did you know it? Is it something that also exists in...your world?",

            "Me": "No, at least, not anymore. We're way too far from that"
        },
        {
            "Beatrice": "I see... Are you from the future?",

            "Me": "Impossible. Ships and boats in my world roamed through seas and rivers, not the sky." 
        },
        {
            "Beatrice": "So, this is your first time seeing what is beyond the sky?",

            "Me": "Not entirely, I've seen it, but not close"
        },
        {
            "Beatrice": "What do you mean?",

            "Me": "Let's say that humans went far beyond this place" 
        },
        {
            "Beatrice": "Beyond this place? Have you reached heaven?",

            "Me": "Nope. We reached space through a boat...or should I say a ship? Whatever. We reached through a bunch of machines"
        },
        {
            "Beatrice": "Machines, with no magic? That's... remarkable",

            "Narrator": ["You went into silence as you realized you have nothing else to say.", "But, Beatrice broke it and asked you with curiosity about her voice."]
        },
        {    
            "Beatrice": "Can you tell me more about your world?",

            "Narrator": "Charlotte shrugged.",
            
            "Charlotte": "Heh. Here's the knowledge-monger"
        },
        {
            "Narrator": "Beatrice, even when her face is hidden behind her hair, spoke flustered.",
    
            "Beatrice": "I-I told you not to call me that... I'm just curious, that's all",
    
            "Me and Charlotte": "..."
        },
        {        
            "Beatrice": "Okay, fine! I would love to learn more! I love learning!",

            "Charlotte": "Beatrice... you're acting like a kid now"
        },
        {
            "Beatrice": "Whatever, Charlotte!",

            "Narrator": ["Hearing their banter left and right, or rather before and behind, you give up and appreciate the scenery that the sky gives.",

            "You nailed your thoughts in a single line."],
        
            "Me": "I'm truly in another world..."
        },
        {
            "Narrator": ["And with that, nothing really changed.", "The airboat still kept on moving to the location—The Republic of Aethelfrith."]
        }
    ]
}