{
	"Stage": "1-6",
	"Dialogue": [
		{
			"Narrator": ["The smoke faded and you saw the aftermath.", "Charlotte stabbed a struggling goblin with the tip of her staff.", "Blood gushed from the area it pierced.", "The goblin glowed a red light, and eventually succumbed to its demise."],

			"Me": "What the..."
		},
		{
		   "Narrator": ["You looked around, and noticed other goblins died a visceral death.", "No wonder Beatrice and Charlotte can purge every goblin in the camp.",

			"They are strong, powerful even. You began to cower upon knowing your weakness.", 

			"You are simply incompatible with this world.",

			"But, you noticed something. From the distance, beyond Charlotte's position, you saw a goblin running away from her.",

			"You shouted at Charlotte."],
			
			"Me": "CHARLOTTE! THERE'S A GOBLIN RUN—"
		},
		{
			"Narrator": ["—ning away.",

			"You were about to finish your sentence when Beatrice tapped your shoulder."],
			
			"Beatrice": ["Don't worry about it.", "That's intentional. Goblins tend to escape and go to a nearby camp.", "If we're lucky, they also go to the nearby camp with better items."],

			"Me": "I actually thought they were smart"
		},
		{
			"Beatrice": "Of course, they are, but all they care about is invading. You can't make conversation with them",

			"Me": "I see. Let's follow her then",

			"Narrator": ["You and Beatrice followed Charlotte, who is following the goblin that escaped. She was hiding, trying to keep herself out of the goblin's sight.", "On the way, you wondered about Charlotte's actions and asked Beatrice."]
		},
		{
			"Me": "Why is she hiding anyways?",

			"Beatrice": "I assumed you already have some knowledge about goblins, but I'll tell you why anyways",

			"Narrator": "She laughed a little, like a noble to a jest, and continued."
		},
		{
			"Beatrice": ["Sorry, but the reason why is that goblins have a keen sense of sight and smell.", "As a matter of fact, the goblin can smell us in our position right now.", "However, they don't understand how far we are, unless they use their eyes. Charlotte is taking that flaw to her advantage."],

			"Narrator": "You scratched your cheek.",
			
			"Me": "But I still don't know the purpose. Also, you forgot to mention their eyes"
		},
		{
			"Beatrice": ["R-Really?... Well, about their eyes. It doesn't require a long explanation.", "Their eyes are similar to goats. Rather, they work pretty much the same way.", "You get it right?"],

			"Narrator": ["You nodded, and looked at Charlotte once again.",

			"You and Beatrice followed her for a while.",

			"And as you begin to feel a bit of exhaustion, a light hits your eyes, blinding you for a moment."],
			
			"Me": "What the hell?"
		},
		{
			"Narrator": ["And when the light disappeared, you noticed Charlotte blinking a light, but this time, hitting Beatrice's chest.", "Beatrice realized what Charlotte meant."],
			
			"Beatrice": ["It's a signal", "We finally arrived at a goblin camp. Follow me"]
		},
		{
			"Narrator": ["Without further ado, she seemed to dash forward and left you behind.", "She was out of sight for a second, and immediately got to Charlotte in the blink of an eye.", "It was too fast for you. And you realized, you were quite far from them. With no one to hear you, you spoke out your frustration."],
			
			"Me": "Are you telling me they can go back faster if I'm not with them?"
		}
	]
}
