{
    "Stage": "1-24",
    "Dialogue": [
        {
            "Narrator": ["Pain.", "Anguish.", "Agony.",

            "It was all you can think of.",

            "Losing your grip on reality, you lost your will—and you passed out.",

            "…",

            "……",

            "………",

            "You opened your eyes and yawned, as if nothing happened.",

            "You looked around the wreckage, where you were summoned."], 

            "Me": "Did I just go back to where I came from?"
        },
        {
            "Narrator": ["And occurred to you, the pain you felt.",

            "The excruciating pain that caused you to pass out."],

            "Me": "Hold on, what just happened earlier? How did I get here?"
        },
        {
            "Narrator": "You got far earlier, and now, you’re in the same place.",

            "Me": "—Wait. What about the golden chest?"
        },
        {
            "Narrator": ["Knowing that the golden chest might have something to bring you out of this dungeon, You went back where you found it.",

            "As you ventured through the labyrinthine of hallways, you began to see that every path feels so familiar to you.",

            "The step marks, the object ruined by your steps, and trash scattered through the ground caused by your climbing.",

            "All of it is your doing."], 
            
            "Me": "Now that I think about it, there are no marks of me going back to the way where I came from?"
        },
        {
            "Narrator": ["As you began sensing that you were going nearby, you started running. The paths are too familiar to you.",

            "You have ventured on these hallways earlier.",

            "And then, you stopped at the room you were looking for, where you saw the golden chest.",

            "However, unlike earlier, it was now open.",

            "And from it, a creature made of roots is standing on it. More like, it is extending from the inside.",

            "It seemed to notice you and it swinged its root arm toward your location.",

            "You managed to evade the attack, and the arm slammed towards the wall.", "You noticed a blade attached to its supposed wrist, which pierced through the wall.",

            "More than that, your action weirded you out."],
            
            "Me": "Why did I instinctively avoid it???"
        },
        {
            "Narrator": ["But you looked before you once again. The blade pierced in the wall.",

            "And the thought surged in your brain.",

            "The time you opened the box. The moment where the creature sprang from within.", "And the moment you felt agony and suddenly found yourself back to the start."],
            "Me": "Why did I get there anyways?"
        },
        {
            "Narrator": "The arm dried out and disintegrated into dust. The blade remained intact.",

            "Me": "What the—"
        },
        {
            "Narrator": ["Before you can say anything, another root arm sprang from the room and immediately hit you.",

            "You managed to shield yourself with your arms, which got pierced by it."],

            "Me": "What the hell?!"
        },
        {
            "Narrator": ["The root arm disintegrated with a blade attached deep to your left arm.",

            "You decided to run away."],
            
            "Me": "To hell with that. Another one from it will kill me."
        },
        {
            "Narrator": ["As you were about to turn around and leave, you felt a stab on your back.",

            "It pushed your body and sprouted from your stomach."],

            "Me": "Wha—EEEEURRRRRRGGGHHHHH!!!!!"
        },
        {
            "Narrator": ["You coughed blood which splashed on your body.",

            "Before you did anything, the arm pulled out, which gushed more blood on your back and forced you to cough what remained.",

            "You have no strength to keep your body standing, and your body falls to the ground.",

            "You mustered what remained of your body and began crawling with your injured arms.",

            "Even if the blade caused your left arm agony, you kept on crawling.",

            "Then, another root arm emerged from the room, and managed to pierced your head.",

            "You cannot do anything about it.",

            "It was instant.",

            "In a blink, you found yourself at the beginning once again.",

            "And as you opened your eyes, you vomited on the ground."]
        }
    ]
}