{
    "Stage": "1-30",
    "Dialogue": [
        {
            "Narrator": ["You contemplated.", "The mage cast lightning, then summoned four.", "This could take you forever.", "Perhaps this method is the reason why the entire area is coated in roots.",

            "Then, you noticed something."],
            
            "Me": "The mage has cast this much lightning. Why hasn't it burned the roots?"
        },
        {
            "Narrator": ["As another lightning hit you, you slammed your blade on the rooted ground.",

            "The current flowed through you until it reached the blade.",

            "The blade, seemingly made of metal, dispersed the current through the root.",

            "It started a fire, then spread out through the root. In an instant, you committed arson."],

            "Me": "Isn’t it spreading too fast??!!"
        },
        {
            "Narrator": ["The fire quickly reached the root creature and the mage and killed them instantly.",

            "Seeing that unfold, you began running as fast as you could.",

            "The fire spread too much.",

            "It actually blocked your way out.",

            "But you have no choice and walk into the flames.",

            "The heat began scorching your skin. Flames got in your fabric.",

            "And then, suddenly, you stepped on solid ground, which caught you off-guard."],

            "Me": "It dissipates quickly! It’s also burning too quickly!"
        },
        {
            "Narrator": ["You noticed a light before you.",

            "Looking around and seeing nothing but flames, you decided to run towards the light.",

            "Your steps become heavy.",

            "The atmosphere got heavy.",

            "The smoke is getting thick, and you’re running out of breath",

            "But the light got brighter and brighter.",

            "Roots from the ceiling began falling down.",

            "And before you touch the light, a huge chunk dropped on you.",

            "It made you immobile and made a huge flame.",

            "Even so, you tried to push through.",

            "There’s no room for holding back. No roots are available for update. Dying here means going back to the start.",

            "Even when you started to burn, even when your strength was fading, you ran and ran.",

            "And then, you were blind by sunlight.",

            "It snapped you back to sanity."],
            
            "Me": "Ah…finally, Vitamin D."
        },
        {
            "": ["You fell to your knees, with your body tattered and burnt.",

            "And you might be hallucinating, but you began hearing a scream."],

            "???": "{{Name}}…!"
        },
        {
            "Narrator": "It must be an illusion.",

            "???": "{{Name}}… {{Name}}! Look at me!"
        },
        {
            "Narrator": ["As the voice said, you looked at it… or rather, looked at her.",

            "You uttered her name."], 
            
            "Me": "Beatrice…"
        },
        {
            "Narrator": "She began casting [ Warmth Touch ] on you, and every pain and ache you have been feeling faded at once.",

            "Me": "Is there a root nearby? I can update my respawn point there."
        },
        {
            "Narrator": "Charlotte, who just arrived, asked.",
            
            "Charlotte": "Why are you looking for a root?",

            "Beatrice": "{{Name}}, just rest for now…"
        },
        {
            "": ["Her warm touch, and the warmth from [ Warmth Touch ], are giving you the comfort you never had in the dungeon.",

            "You felt at peace once again.",

            "After a while, you can at least sleep without danger.",

            "You closed your eyes and brought yourself into slumber.",
            
            "To be continued."]
        }
    ]
}