{
    "Stage": "1-12",
    "Dialogue": [
        {
            "Narrator": ["You were surrounded by goblins.",

            "Their lustrous eyes and their mouths drooling in saliva as they looked at you with satiation.",

            "You were summoned to be eaten.",

            "An outsider. A person who doesn’t belong in this world.",

            "The goblins raised their butcher knives. The tip glistened and its surface reflected your frightened face.",

            "No one is there to save you.",

            "Then, someone smacked your head."],

            "Me": "—!"
        },
        {
            "Narrator": ["You found yourself surrounded by two women. Sure, you made fantasies about things, but imagining the goblins as two cute women is just too absurd for someone that was about to be eaten by them.",

            "Then, it occurred to you.",

            "You knew you survived this encounter—with the women that saved you.",

            "The women you are seeing right now."],

            "Me": "What a nightmare. I guess I’m in a cage somewhere in the ruined dungeon right now.",

            "Beatrice": "What are you talking about?"
        },
        {
            "Narrator": "Those words were said by Beatrice. You can only see half of her body. She is clearly outside the airboat.",

            "Me": "—Wait. Airboat?"
        },
        {
            "Narrator": "It came to you. You are travelling with Beatrice and Charlotte to the Republic of Aethelfrith.",

            "Me": "The trauma must have been engraved into my consciousness.",

            "Beatrice": "{{Name}}, are you alright?"
        },
        {
            "Narrator": "It was then asked by Beatrice, standing beside Charlotte.",
            
            "Beatrice": "Do you want to rest more?",
            
            "Charlotte": "But Beatrice, we’re bringing him to the meeting."
        },
        {
            "Beatrice": "Charlotte, he is clearly exhausted.",

            "Charlotte": "But still…",

            "Narrator": "Seeing that their banter will go nowhere, you stepped out of the airboat and talked to the two.",

            "Me": "Well, we’re going on a meeting, right? Let’s go then"
        },
        {
            "Beatrice": "Are you sure? Do you want to rest more?",

            "Narrator":  ["You looked at Beatrice and the worriness in her eyes.", "You sighed and scratched the back of your head."],

            "Me": "I’m fine. I took plenty of rest earlier. So, let’s go to the meeting already."
        },
        {
                "Beatrice": "Well, I won’t force you, but sure tell me if you felt something",

                "Me": ["Alrighty,", "But where are we anyways? I don’t remember the sea looking like that."],

                "Narrator": "Beatrice and Charlotte looked at each other, dumbfounded. Charlotte took the initiative and gave you the answer you wanted.",
                
                "Charlotte": "{{Name}}… have you forgotten that we travelled above the sky using that boat?"
        },
        {
            "Narrator": ["It clicked in your mind. It occurred to you…and also became clear to your mind.",

            "You found out that you’re currently standing on a platform, seemingly hovering over the clouds.",

            "From seeing the vast clouds, you felt your stomach."],

            "Me": "Arggh, I’m gonna puke."
        },
        {
            "Me": "You vomited before Beatrice and Charlotte."
        }
    ]
}