{
    "Stage": "1-19",
    "Dialogue": [
        {
            "Narrator": ["After breakfast, the three of you left immediately, which caught you off guard.", "You have not taken a bath. Nor brushed your teeth and changed clothes.", "But in the carriage you're currently riding, Beatrice cast out a spell on you and cleansed you, with Charlotte sitting beside her"],

            "Beatrice": "Would that suffice?",
            
            "Charlotte": "See? She is good at using magic. She can use [ Sacred Touch ] with ease when most are struggling."
        },
        {
            "Narrator": "You sniffed your clothes and your armpits, and found out there's no smell. As if the clothes you're wearing are newly bought.",
            
            "Me": "Damn. you really resetted me into a new person",

            "Charlotte": "Right? No one can be compared to her. She's one of a kind.",

            "Beatrice": "You two are teasing me again!"
        },
        {
            "Narrator": ["Laughter echoed throughout the carriage.",

            "But then, you got curious.",

            "The three of you are going to the meeting with \"His Excellency,\"", "Frederick of Masons. He is the president of this place, the Republic of Aethelfrith.", "The purpose is to bring up the rumors about goblins summoning humans for food."],

            "Me": "Hey, Beatrice, Charlotte. How would the meeting usually go here?",

            "Charlotte": ["Well, since it's a meeting with His Excellency, it will involve both the Senate and Factions.", "Since you're in the boundary of an immigrant and outsider, Ser Gregory will be the one representing you, with Beatrice and I as benefactors.",

            "A representative of each faction will ask you questions, on which you will be the one answering.", "Then, you will be asked by the adviser on His Excellency’s behalf, which both Beatrice and I answer on your behalf.", "The Senate will be the ones making a decision."]
        },
        {
            "Narrator": "You thought about her words, and found out it is more of a hearing than a meeting. You are basically going to be interrogated.",

            "Me": "It seems to me that there's still some doubt from them. This setup is more of an interrogation.",

            "Charlotte": "Don't take it too seriously. We already have enough evidence to prove the rumors are true."
        },
        {
            "Me": "I think they will be interested in me more than the rumors. I don't like attention for something trivial, just saying.",

            "Charlotte": "What are you talking about?"
        },
        {
            "Me": "Well, I don't mind if it's the ladies.",

            "Charlotte": "Urgh…you're a man alright",

            "Narrator": ["And, moments later, the carriage arrived before the Palace, at the backyard.", "As the three of you went out, you saw the Palace in daylight.", "Maids sprinkling the grasses and the shrubs, and guards standing before the pathway.", "As the three of you walk along the path, you can't help but feel intimated, while Beatrice and Charlotte walk with grandeur and elegance.",

            "You entered the Palace with them, and went to the Courtroom. Currently, the three of you are standing before a door that leads inside.",

            "Beatrice asked you."], 
            
            "Beatrice": "#Name, are you ready?" 
        },
        {
            "Narrator": "You smirked.",
            
            "Me": "Of course, I am. I have no idea what would transpire inside at all" 
        },
        {
            "Narrator": "Beatrice gave a short giggle.",
            "Beatrice": "Well, whatever gives you confidence. Just remember, we're at your side."
        },
        {
            "Narrator": ["With that, the door opens, revealing the interior, similar to the Senate courtroom on Earth.", "In fact, you could say it is the Senate courtroom.",

            "Inside, the Senate occupied the left side of the President, while the Factions occupied the right side.", "The President is sitting in a chair facing the three of you."]
        }
    ]
}