{
    "Stage": "1-16",
    "Dialogue": [
            {
                "Narrator": ["The three of you entered inside and stumbled first upon the lobby of the building, which was more of a reception area with the reception desk facing the entrance. Beatrice and Charlotte approached the receptionists.",

                "Beatrice took the initiative and spoke first."],
                 
                "Beatrice": "Is Gregory of Masons here?",

                "Female Clerk": "He’s currently busy with paperworks for sending quests tomorrow. May I know your inquiry?"
            },
            {
                "Beatrice": "I want to tell him we found a lead regarding the rumors about goblin summoning people from other world to eat them",

                "Female Clerk": "Pardon? Goblins summoning people from another world to eat them? W-Wait a minute! How can you be so certain?",

                "Narrator": "Charlotte tapped your shoulder, smirking.",

                "Charlotte": "Here’s the evidence. This one’s alive."
            },
            {
             "Me": "Don’t treat me like an object",

             "Narrator": "The female clerk went into silence, her jaws dropped at the sight of you.",
             
             "Female Clerk": "I-I’ll give notice to Mr. Gregory right away… For now, have a rest in the lounge room"
            },
            {
                "Narrator": [
                "The female clerk ran in a hurry in the hallway.", "Meanwhile, the three of you went to the said lounge room. The lounge room is gravely adored, with floral ornaments and bright colorful fabrics on the wall.", "The sofas are clearly made of leather instead of the modern synthetic fabrics like polyester.", "In the middle is a wooden table with an articulate design, with a carpet beneath.", "It has a vase adorned with orchids—and Charlotte snapped you back to reality with a gentle nudge, sitting on your left."],

                "Charlotte": "Hey, you have been staring at nowhere. It’s making me uncomfortable",

                "Me": "Oh, just a stream-of-consciousness."
            },
            {
                "Charlotte": "Stream of…consciousness?",

                "Narrator": "As you were about to answer, the door of the lounge room opened, accompanied by a voice.",
                
                "???": "Beatrice? I heard the two of you found evidence."
            },
            {
                "Narrator": "You paid the speaker a look. Wearing a clerical dress, it is crystal clear what his position is.",
                
                "???": "Oh? I’m surprised for you two to be with a man."
            },
            {
                "Narrator": "Beatrice, sitting on your right, responded to him.",
                
                "Beatrice": "Good evening, Mr. Gregory. I brought proof of the growing rumors about goblins summoning humans for their sustenance."
            },
            {
                "Narrator": "The man, Gregory of Masons, scratched his cheek, as if embarrassed.",
                
                "Gregory of Masons": "Don’t be so formal with me, Beatrice, especially when you're from nobility.",

                "Beatrice": "Mr. Gregory, we have an outsider here!"
            },
            {
                "Narrator": "Gregory gave you a look, ignoring the flustered and embarrassed Beatrice. You took the initiative and bowed before him.",
                
                "Me": "Sir Gregory, pardon me. I am nothing but an outsider of this world."
            },
            {
                "Narrator": ["And the room was consumed by silence. Medieval rooms.", "Medieval outfits. Medieval infrastructure.", "It is clearly in the medieval ages.", "In this world, you’re not a commoner but a foreigner.", "A man of an otherworldly origin.", "Beatrice and Charlotte went into silence. Gregory looked at you unbothered.",

                "But you will never raise your head as long as the noble before you haven’t given his response.", "Even a silence and leaving you in your state would suffice.",

                "Yet, he responded, breaking your expectations."], 
                
                "Gregory of Masons": "Outsider, you say?",

                "Beatrice": "He’s the proof that the rumors are true, Mr. Gregory."
            },
            {
                "Narrator": ["I heard that already, but the way you’re saying \"outsider\" seems like you’re referring to yourself as a person of a different place.", "Tell me about yourself"],

                "Me": ["Yes, sir", "I’m {{Name}}. A man from a different world called Earth."]
            },
            {
                "Gregory of Masons": "Earth? Is that what you call your world?",

                "Me": "Yes, sir.",

                "Narrator": "Gregory then faced Beatrice."
            }, 
            {
                "Gregory of Masons": "Aside from him, what information did you find?",

                "Beatrice": "{{Name}} is covered in Holy Magic, indicating that the goblins have access to holy magic. I also fought a goblin who is capable of using magic",

                "Narrator": "Gregory held his chin upon hearing the briefing of Beatrice."
            },
            {
                "Gregory of Masons": "Holy magic, huh. Seems that they must have learned it from the relics they found in the Rooted Kingdom.",
                
                "Beatrice": "Rooted Kingdom, you say… are you suggesting that goblins got access to holy magic from relics?"
            },
            {
                "Gregory of Masons": "Possibly. After all, enchanting is about putting spells on objects.",

                "Narrator": "Then, Gregory tapped your shoulder."
            },
            {
                "Gregory of Masons": "Raise your head, Outsider. And also, welcome to the world of Gaia.",

                "Me": "Gaia, sir? Is that the name of this world?"
            },
            {
                "Gregory of Masons": ["Yes,", "But to you, what's the difference between this world and yours?"],

                "Me": "Let’s see…",

                "Narrator": ["You contemplated.", "Aside from the obviously medieval culture present in this world, there’s no difference.", "You still did not know if there are more than the English Language, but other than that, the difference would be…"]
            },
            {
                "Me": "…My world lacks monsters and magic.",

                "Gregory of Masons": ["Oh…", "Interesting"],

                "Narrator": "Gregory let go of your shoulder."
            },
            {
                "Gregory of Masons": "So, people in your world don’t use magic…Beatrice, does he have a mana?",

                "Beatrice": ["No, Mr. Gregory.", "{{Name}} lacks the capacity to use magic. Though spells are still applicable to him."]
            },
            {
                "Gregory of Masons": "Now, that’s a problem.",

                "Beatrice": "Why?"
            },
            {
                "Gregory of Masons": "What do you think is the definition of human in academic texts?",

                "Beatrice": ["A creation of the world, blessed with power to use magic…?", "Honestly, what are you trying to imply here?"]
            },
            {
                "Gregory of Masons": "He is considered a thing, Beatrice. Someone meant to be owned.",

                "Beatrice": "{{Name}} ISN’T AN OB—"
            },
            {
                "Gregory of Masons": "I know, but in the eyes of the nobles of this country, he is. To anyone else, {{Name}} is a human without a soul, a homunculus.",

                "Charlotte": ["Hold on!", "If that’s the case, then, what would happen to him?"]
            },
            {
                "Gregory of Masons": "Either the Alchemy Guild take possession of him or the Senate would give to some royalty for diplomacy",

                "Beatrice": ["I’ll refuse,", "{{Name}} is not an object."]
            },
            {
                "Gregory of Masons": ["Beatrice…you are as kind as ever.", "But, let me ask you, how will you handle him?"],

                "Beatrice": "I-I’ll figure it out…",

                "Charlotte": "Beatrice…"
            },
            {
                "Narrator": "Gregory sighed. He looked at you and tapped your shoulder once again.",
                
                "Gregory of Masons": ["You’re one hell of a lucky guy, Outsider.", "First, being saved especially by Beatrice and Charlotte from goblins, and now, vouching for your human rights.", "The summonees before you aren’t so lucky at all.",

                "And just so you know, this will be marked in history. This is the world’s earliest encounter with an outsider, that is You…"]
            },
            {
                "Narrator": "He finally let go of your shoulder and turned around you.",
                
                "Gregory of Masons": "I’ll make a request to His Excellency for the meeting regarding the rumors. As for the three of you, prepare yourselves for the meeting."
            },
            {
                "Narrator": "Gregory left the room, with the three of you remaining inside. Beatrice held your arm and looked at you with pity.",
                
                "Beatrice": "Don’t worry, we’ll figure out something about this."
            },
            {
                "Narrator": ["The three of you left the palace and looked for a place to rest.", "The three of you eventually found a hostel, where Beatrice and Charlotte left you behind to bring the loot they got from attacking goblin camps earlier.",

                "You are currently lying in a bunk bed with nothing else to do."],
                
                "Me": ["So, this world also has a hostel, even though they call it an inn.", "Inns don’t use bunk beds, by the way!"]
            },
            {
                "Narrator": ["You looked at the book you’re holding called \"The Life of the Republic,\" which you requested before the two ladies leave.", "You want information about the world you’re living, after all.",

                "Beatrice and Charlotte have done a lot to you.", "You learned a lot about them hours after meeting them.", "Even though you are an outsider, they welcomed you with kindness. You began to question your place in this world.",

                "But, the modern human that you are, decided to do the most modern approach to the problem."],
                
                "Me": "Well, it’s not like I can do anything right now. Rather, I have no idea what to do."
            },
            {
                "Narrator": "You closed your eyes and went to sleep."
            }
    ]
}