{
    "Stage": "1-20",
    "Dialogue": [
        {
            "Narrator": "The three of you went in and approached the president of Aethelfrith. Beatrice and Charlotte stood before him while you knelt.",

            "Beatrice": "Greetings, Your Excellency",

            "Charlotte": "Thank you for giving us your time."
        },
        {
            "Narrator": "The President spoke, voice deep and with grandeur.",
            
            "Frederick of Masons": "You two are as charming as ever, ladies. How's your adventure in the Goblin Zone?",

            "Beatrice": "All good, Your Excellency. We managed to defeat and destroy goblins in half of the Goblin Zone." 
        },
        {
            "Frederick of Masons": "That's good then. I’m glad the two of you are safe. Your parents keep on prying me about you two.",

            "Beatrice": "Thank you, Your Excellency.",

            "Narrator": ["Then, the President looked at you, still kneeling in the wrong posture.", "Your left leg is kneeling instead of the right leg.",

            "But the President didn't seem to bother and spoke."]
        }, 
        {
            "Frederick of Masons": "Oh? Is he the Outsider?",

            "Beatrice": "Yes, Your Excellency.",

            "Narrator": "He looked at you furthermore, as if he's judging."
        },
        {
            "Frederick of Masons": "I can see how he is an outsider that much, with that strange clothing.",

            "Narrator": "The President sighed"
        }, 
        {
            "Frederick of Masons": "But whatever, Outsider, state your name before the audience.",

            "Narrator": "You stood up, head still lowered, and spoke.",
            
            "Me": "Greetings, Your Excellency. I’m {{Name}}"
        },
        {
            "Frederick of Masons": "Nice to meet you, {{Name}}.",

            "Narrator": "The President stood up and proclaimed the start of the meeting."
        },
        {
            "Frederick of Masons": "Well, then…everyone in the court. The meeting is in motion.",

            "Narrator": ["Everyone stood up and bowed towards the President.",

            "As the President sat on his chair, the advisor before him gave Beatrice and Charlotte a notice."],
            
            "Advisor": "Lady. Beatrice and Lady. Charlotte, may you enlighten us on the event that occurred yesterday." 
        },
        {
            "Narrator": ["Beatrice volunteered to speak about what happened yesterday.", "She told everyone about your supposed demise, a horrible beginning.", "And everything that Beatrice and Charlotte did afterwards.",

            "Everyone who heard her account is in disbelief.",

            "One of the Senate spoke."],
            
            "Senator A": "How can you tell that this Outsider is actually from another world?"
        },
        {
            "Narrator": "Beatrice spoke with formality, different from the Beatrice you have seen until now.",
            
            "Beatrice": "{{Name}} has no mana and he is covered in Holy Magic residue from the summoning. He also has no knowledge whatsoever about Gaia."
        },
        {
            "Narrator": "Another one interjected",
            
            "Senator B": "How can we be certain that he is an actual outsider and not another fake?",

            "Beatrice": "{{Name}} has no relatives nor friends and acquaintances in our world. No records of him exist in the archives."
        },
        {
            "Frederick of Masons": "If you may, {{Name}}, may you allow the alchemists and mages to appraise.",

            "Me": "S-Sure…",

            "Narrator": ["You uttered in response, being caught off guard.", "Some alchemists and mages approached you in line, and raised their hands before you and got an appraisal.", "All of their expressions were in awe as they saw the results they got."],

            "Alchemist A": "T-This dude has different antibodies…",

            "Alchemist B": "He doesn't actually have mana…",

            "Mage": "This dude is not blessed at all."
        },
        {
            "Narrator": ["Each of their words pierced your pride, your humanity. But all you did was close your eyes.",

            "When the line was over, everyone began to discuss the evidence they garnered.", "You sat with Beatrice and Charlotte, with the two looking at you with concern."],

            "Beatrice": "Are you alright, {{Name}}?",

            "Me": "I’m good. Just got tired from standing and being touched by many men."
        },
        {
            "Beatrice": "If you say so…"
        }
    ]
}