{
    "Stage": "1-14",
    "Dialogue": [
        {
            "Narrator": ["It was night, yet the streets were bustling. Lamplighters began igniting the streetlamps.", "Carriages and wagons roamed on the brick roads. Pedestrians and passersby walking along the sidewalks.",

                        "This place is clearly living in the medieval ages.",

                        "And you are currently standing on the same street with Beatrice and Charlotte. You are still holding your stomach from the airsickness you felt."],

            "Me": "I’m good with elevation… but that place is just too high and too windy…",

            "Charlotte": "Are you sure you don’t want Beatrice’s healing?"
        },
        {
            "Me": "I’m a man. This is nothing.",

            "Charlotte": "Ah, men and their pride",

            "Narrator": "As you succumbed furthermore to the aftermath of airsickness, a carriage stopped suddenly before you."
        },
        {
            "Me": "I haven’t even raised my hand yet",

            "Narrator": "The driver stepped out of his seat and greeted the two ladies.",
        
            "Driver": "Good evening, Lady Beatrice and Charlotte. Nice to meet the two of you once again."
        },
        {
            "Narrator": "You noticed the formality of his words, so you asked the two.",

            "Me": "Are you two noble?"
        },
        {
            "Narrator": ["The two jolted.", "Beatrice frantically looked around and Charlotte covered your mouth in a swift."],

            "Charlotte": "You gotta shut that mouth of yours."
        },
        {
            "Narrator": "Your voice is muffled with her hand, but you managed to ask.",

            "Me": "What now?!! What’s wrong with what I asked??!!",

            "Charlotte": "Just shut up and get in the carriage!"
        },
        {
            "Narrator": "She tossed you to the wagon. The two quickly joined you inside.",
            
            "Charlotte": "Driver, take us to the Aethelfrith Palace!"
        },
        {
            "Narrator": "As the wagon began to move, Charlotte let go of your mouth.",
            
            "Charlotte": "Can’t you just not ask about it out of nowhere?",

            "Me": "I have no idea what you’re talking about"
        },
        {
            "Charlotte": ["Don’t ask us if we’re nobles!", "...", "Not many, especially the public, know we’re nobles. We’re not even planning to tell you"],

            "Me": "Then, why did the driver greet you like one right in the open?"
        },
        {
            "Charlotte": "He is a dunderhead. Don’t mind him.",

            "Me": "No one says dunderhead anymore…"
        },
        {
            "Charlotte": "You—!",

            "Narrator": "Charlotte slapped you on the shoulder. It did not hurt you, but you still feel it.",

            "Me": "Beatrice, she’s getting violent on me!"
        },
        {
            "Narrator": "Beatrice looked at you with anguish, seemingly bothered by your actions earlier.",

            "Beatrice": "W-Well, you kind of deserved it?",

            "Me": "What the hell?"
        },
        {
            "Narrator": ["Despite the humorous banter, Beatrice’s eyes became downcast.",

            "You looked at Charlotte and asked." ],

            "Me": "Charlotte, did I mess up?",

            "Charlotte": ["Well, while we’re sensitive to our nobility being known, our reason for it is quite in huge contrast.","I’m just hiding it because I don’t want to be surrounded by people, but to Beatrice, it’s different.",

            "You don’t want to hear it from me, right?"]
        },
        {
            "Narrator": "You scratched your head, regretting your actions earlier.",

            "Me": "I understand. I won’t pry on it."
        },
        {
            "Narrator": [
            "Just like that, the time passed, and the carriage stopped at the Aethelfrith Palace.",
            "Charlotte went out first.",

            "Beatrice also stood up and stepped outside.",

            "Then, you stepped out last. But seeing Beatrice’s face, you can’t help but apologize."],
            
            "Me": "Beatrice, I’m sorry—"
        },
        {
            "Narrator": "Before you finished your words, Beatrice turned her back before you.",

            "Beatrice": ["It’s fine. You’re not at fault in the first place.", "It’s just that… I became sensitive to my identity being revealed.", "But now that you know, don’t tell everyone, okay?"],

            "Me": "I won’t tell anyone. I swear in Charlotte’s name."
        },
        {
            "Charlotte": "What the hell? Take it back!",

            "Narrator": ["As the three of you walked along the brick walkway, you looked around the place’s extravagance.", "A vast garden with beautiful trees and shrubs. Some clearly blossomed various flowers.", "This garden is more of a park with the area seemingly divided into squares, each with benches on all sides, and bandstands in the center.",

            "After a long walk, the three of you managed to reach the entrance. The palace is made with medieval architecture. Its walls and floors are made from stones.",

            "Two guards are stationed at the entrance door. They opened the wooden door before the three of you."]
        }
    ]
}