{
    "Stage": "1-8",
    "Dialogue": [
        {          
            "": ["You heard explosions from the location that Beatrice and Charlotte went.",

            "Sweat ran through your forehead. You have been walking through the mounds.",

            "Going up and down in a sequence wore you down.",

            "Now, you seek rest more than anything else, but the field is dangerous.", 

            "You gasped for breath.",

            "And stop.",

            "A little bit of a pause is fine.", 

            "However, you felt a wind behind you.", 

            "Sure, a vast steppe with mounds has winds.",

            "But the wind came from the direction you are facing.", 

            "And with a peek, you looked behind you.",

            "And your eyes widened, as the sight behind you is the usual steppe, with a goblin standing.",

            "Unlike the goblins on your first encounter with them, this one wore an adorned outfit.",

            "Aside from the fabric wrapped around its body, it also wears a stole with the symbol; which is more of a stamp of a stone with a paint.",

            "It is also holding a staff with an orb embedded in it.",

            "You did not bother by its unusual outfit and immediately ran.",

            "But as you took a step forward, you slipped.",

            "Head first, your face was dragged across the field.",

            "As you befall, you look at your lower body.",

            "And you discovered translucent chains are tied to your ankles. You saw the goblin with the orb on its staff  glowing. It raised its arm and faced its palm before you.",

            "The goblin simply cast a spell on you, and a ball of flame hit your face, and you screamed as its searing heat raced through its skin."],

            "Me": "AHHHHHHHHHHHHH"
        },
        {
            "": ["You cannot handle the anguish and cowered.",

            "And while you succumbed to agony, the goblin spoke. Even with the jagged and monotonous voice, it spoke to  you with confidence."],

            "Goblin Shaman": "Whatchu doin' here, outsider? Ain't ya supposed to be eaten now?"
        },
        {
            "": ["You replied with another scream from your anguish.",

            "But the goblin didn't mind."],

            "Goblin Shaman": "Is this how ya humans talk?"
        },
        {
            "": ["It began holding its staff with two hands, and it smashed the ground with its tip.",

            "The ground shook and you were thrown away. Your body reached the peak of the mound and you rolled over the slope.",

            "You continued rolling on the ground and eventually hit the bottom of another mound.",

            "The goblin jumped to the position before you."],

            "Goblin Shaman": "Ya're odd. Ya are too weak than humans I fight! Ya are an outsider! HAHAHAHAHA"
        },
        {
            "": ["It began laughing hysterically. Its face showed a twisted and uncanny grin. It is having fun with you.",

            "Then, you heard a scream of a woman. A scream so strong it burst on your ears."],

            "???": "YOU GOBLIN—!!!" 
        },
        {
            "": ["You heard a splash as the ground trembled.",

            "You have no idea what is going on, so you cowered in fear once again and covered your head. ",

            "But you felt a touch of warmth. It spreads throughout your body. You felt calm.",

            "You opened your eyes that have been shutting, and looked above you.",

            "It was Beatrice, touching your arm, facing the goblin that caused you agony.",

            "She is looking at you with such tender eyes."],

            "Beatrice": "How do you do?"
        },
        {
            "": "You're lost for an answer. The agony you felt is still vivid. And yet, she assured you.",

            "Beatrice": "You don't have to answer, but you can trust me. I can handle this"
        },
        {
            "": "After healing you, she stood up and approached the goblin.",

            "Beatrice": "Pardon me but...this day will be your last"
        }, 
        {
           "": ["Luminous sigils began appearing around her body, hovering around in a circular motion.",

            "Watching from your position, you can't help but react with disbelief."],

            "Me": "Just how overpowered you two are?"
        }, 
        {
            "": "Beatrice dashed forward towards the goblin and a smoke exuded from their position, obscuring them."
        }
    ]
}