{
    "Stage": "1-9",
    "Dialogue":[
        {    
            "": ["Within the smoke, Beatrice cast a spell. Her hands glowed a violet hue, a manifestation of magic, and blasted it against the goblin.",

            "The goblin parried it with a barrier from its hand and took a stance.",

            "A white glow manifested on its other hand and blasted it towards Beatrice.",

            "Despite the intense surge, Beatrice did nothing but stood against the incoming blast.",

            "It hit her, the light warped through the crevices of her body.",

            "When the blast dissipated, Beatrice remained standing, unscathed."],
            
            "Beatrice": "You're underestimating me."
        },
        {
        "": "The goblin jolted upon hearing those words. Perhaps he realized who he is against. Beatrice raised her staff and its orb radiated a green hue.",

        "Beatrice": "I'm trained to be a healer, but you see, every mage is trained to be versatile."
        },
        {
        "": ["A luminous magic circle appeared before her, hovering on her palm.",

        "Her presence became intense, the wind gone wild and everything around fluttered intensely, even her clothes.",

        "Yet, with a single word, the intensity of her surroundings have gone stale. The wind became calm.",

        "But from the sky, a hole was made from the clouds, illuminating the steppe with sunlight.",

        "Beatrice gasped and sighed."], 
        
        "Beatrice": "Impact"
        },
        {
        "": ["[And an intense beam surged from the heavens, and eradicated the goblin in one piece.",

        "The intensity created a smoke that engulfed the surroundings, including Beatrice.",

        "From a distance, you saw it in a thin light. Yet, its impact reached your position.",

        "Then, just like thunder, the beam dissipated. But it left a gap in the sky, a small price to pay.",

        "...",

        "The smoke dissipated, and you saw Beatrice standing. She defeated the goblin.",

        "You jolted as you heard another step.",

        "Even Beatrice raised her staff.", 

        "But as you look beyond your head, from the mound, Charlotte emerges full of blood on her body.",

        "She waved at the two of you with vigor."],
    
        "Beatrice": "Hey there, everyone. Is everything good there?"
        },
        {
            "": "She stopped her steps as she noticed your situation.",
            
            "Charlotte":"Hey, are you good? Did something happen to him?",

            "Beatrice": "He's fine. I healed him." 
        },
        {
            "Charlotte": "Okay then",

            "": ["Charlotte rummaged through the purse that Beatrice is supposed to carry and took something.",

            "Upon showing it, you found out it is a key."]
        },
        {
            "Charlotte": "I found their airboat!"
        }
    ]
}