{
    "Stage": "1-23",
    "Dialogue": [
        {               
            "Narrator": ["You entered the asylum and met a clerk that led you to a room.", "Upon going inside, you found out it is a room in complete darkness, only illuminated with the light from a portal, hovering from the ground.",

            "The clerk spoke."], 
            
            "Male Clerk": ["Mr. {{Name}}. This is the Trial Room.", "The portal will send you to an authorized dungeon within the Rooted Kingdom.", "As an immigrant, you will be put into a Trial.", "Trial, in simpler terms, is a test of commitment to the Republic."]
        },
        {
            "Narrator": "As he was about to continue, you interjected.",
            
            "Me": "Hold on, I’m not dying there, am I?",

            "Male Clerk": ["Be assured, Mr. {{Name}}.", "While there are dangers, you will not be killed. I would say, you will suffer.", "But, just so you know, not going to the trial will not grant you citizenship in the Republic."]
        },
        {
            "Me": "Okay, fine. I don’t have anything to lose in the first place.",

            "Male Clerk": "Well then, Mr. {{Name}}. Please enter the portal. Good luck.",

            "Narrator": ["The clerk patted you on your shoulder, but actually, you became nervous.",

            "You began contemplating everything that transpired.", "The first encounter with the goblins, first encounter with Beatrice and Charlotte, and your first step on the Aethelfrith Republic.",

            "Now that you thought about it, you were just following along them, like a moss following the current.",

            "At this point, you can’t go back. Beatrice will be anguished and Charlotte might be disappointed.",

            "With a step, you made a decision.",

            "You approached the portal and started to feel a force from it that is pulling you in.",

            "As you were about to reach the portal, you closed your eyes and went in.",

            "The portal consumed you—and you found yourself in a hallway of a dungeon, full of wreckage of carriages"]
        },
        {
            "Me": "What on earth happened here?",

            "Narrator": ["Considering that this is a part of the Trial, you ventured further from the wreckage.",

            "You stumbled upon more wreckage and a pile of garbage, on which you climbed over to go to the other side.",

            "Their smell is strong. You began to hold your nose to avoid smelling this strong foul odor.",

            "And as you ventured further, you began seeing more and more wreckage, and you began to notice some wreckage with objects made of gold and rusted weapons.",

            "After looking for a while, you decided to investigate a wreckage nearby. It has a golden chest, which could be a trap. But, according to the clerk, he can’t die.",

            "After garnering a bit of courage, you decided to open the chest.",

            "You were about to touch it, but it suddenly opened and a creature sprang from the inside.",

            "It is coated—or in better description—seemingly made of roots.",

            "You moved back as it sprang. But—",

            "Before assessing the situation, you heard a snap, like a crack of a whip.",

            "Your vision began tilting, despite not tilting your head.",

            "You haven’t felt anything wrong.",

            "But you can’t feel your body. Nor your mind.",

            "Your vision seemed to be slipping.",

            "And suddenly, you dropped to the ground, at least what was lost from your body.",

            "Then, you saw your body slumped to the ground, right before you.",

            "You began losing yourself.",

            "Eventually, you succumbed to nothingness.",

            "You died.",

            "…",

            "……",

            "………"]
        },
        {
            "Me": "—!",

            "Narrator": "Your head started aching, so bad, you knelt on the ground."
        },
        {
            "Me": "It hurts! It hurts! It hurts! It hurts! It hurts! It hurts! It hurts! It hurts! It hurts! It hurts! It hurts!It hurts—!",

            "Narrator": ["You began uttering the words of excruciating pain.",

            "The pain inflicted on you is too much to handle. You began hyperventilating.",

            "Somehow, you found yourself back to where you began.",

            "At this point, the Trial has just begun."]
        }
    ]
}