{
    "Stage": "1-27",
    "Dialogue": [
        {
            "Narrator": "…",

            "Me": "—!"
        },
        {
            "Narrator": "You gasped for breath. Your eyes widened and you fell down to your knees.",
            
            "Me": "This is too much, isn’t it?"
        },
        {
            "Narrator": "You decided to take a rest, until you heard a loud rumbling.",

            "Me": "What the hell??!!! This is too far, you know???!!"
        },
        {
            "Narrator": ["You turned around and ran away. Knowing that the gigantic monster came from behind, it is certain that the path where it came from must be safe.",

            "However, you cannot learn about it that easily. The huge root creature managed to catch up on you in a sprint.",

            "As it tried to stop, it tripped and bumped on you.",

            "With your body way lighter than the root creature, it took you with it and slammed together on the ground. It killed you instantly.",

            "…",

            "……",

            "………",

            "…………",

            "Fifty times.",

            "It has been fifty times that you died. You also began to be covered in thin black roots on your body.", "You have not noticed it because it is rooted from the chest, where your heart is.",

            "Nevertheless, you figured out how this resurrection works.",

            "Currently, you just got resurrected from your last death.",

            "But you learned a lot from your encounter with the giant root creature.",

            "It is about to reach you once again.",

            "But you climbed on the walls until you reached the ceiling.",

            "As the giant reached you, it tried to stop, but due to momentum, it slipped once again.",

            "You dropped on the ground. And unlike last time, you approached the giant with confidence.",

            "You took a rusty sword from the ground, which came from the ruckus both you and the giant made.",

            "As you reached the lying giant, you pierced the sword through its torso.",

            "Finally, after attempting to jump into the ceiling, waiting for the giant to make a hard slip, and managed to stab it, you finally completed them.",

            "After trying over and over, you finally killed the giant.",

            "From there, you pondered how long it has been since you got here, and if there are more enemies.",

            "Nevertheless, you learned something.",

            "The giant root creature disintegrated into roots, which detached from each other and spread through the ground and the bottom side of the wall, like worms crawling away.", 

            "After growing far enough from each other, they seemed to embed themselves to the surface.",

            "Despite all of that, you knelt before the root wedge, and touched it with your hand.",

            "Its tiny and thin roots attached to your hand for a moment, then let go."],

            "Me": "Respawn point set."
        },
        {
            "Narrator": ["Earlier, as you attempted to avoid the giant, you began to find black roots embedded in the walls and the floor.", "And touching you makes you resurrect to that location of the root you touched.", "Touching other root wedges also updates the \"respawn point.\"",

            "You still have no idea why you respawned at the beginning earlier though.",

            "Nonetheless, you did it.", "And before you went further, you scavenged for weapons and gears through the wreckage and pile of trash around.", "After a while, you touched the root wedge made from giant once again, and ventured further down the dungeon."]
        }
    ]
}