{
    "Stage": "1-28",
    "Dialogue": [
        {
            "Narrator": ["One-hundred and thirteen deaths.",

            "You get the hang of it.", "You killed every root creature you found, even if it caused you life.", "You do not want another giant root creature.",
            "Currently, you are holding the blade from the root creature you killed.", "Unlike rusted weapons, the blade from them does not rust. And the shield, which you found on the wreckage."],

            "Me": "It’s getting boring, but that’s what makes it okay."  
        },
        {
            "Narrator": ["You started coping with the situation you are in.", "You looked for every corner and every nook and canny, only to find more wreckage, more piles of garbage, and more rusted equipment."],

            "Me": "How did this dungeon get so many carriages in the first place? Is this stable or something?"
        },
        {    
            "Narrator": ["As you contemplated the place, you heard a roar.",

            "Before going to the source, you looked around on the remaining paths, only to find nothing."],

            "Me": "Wow, nothing, as in nothing. No root creatures to update my respawn point."
        },
        {
            "Narrator": ["Disappointed, you decided to go further down the path where you heard the roar.",

            "On your way, you began noticing an area full of roots beyond.",

            "As you went further, you discovered that not only the area beyond is dark, but also covered entirely in roots.",

            "And you stepped on them, the thin roots began clinging to your feet."],
            
            "Me": "Would this also update my respawn point?"
        },
        {
            "Narrator": ["You ventured further down the seemingly vast area.", "With no fear nor confidence, you raised your blade and would fight whatever awaits you within.", "You began noticing your steps or making a cracking sound.",

            "Then, the room lit up in a blink.", "The green hue engulfed the entire space, and from it, you learned that the entire area is a catabomb.", "Skulls adored the walls and their bones filled the ground, all covered in roots.",

            "In the center of it is a root creature, wearing a robe and holding a staff with an orb attached to it."],

            "Me": "How can a brainless creature be a mage?"
        },
        {
            "Narrator": ["The root mage cast a spell, as if offended by your words.",

            "A thunderous roar can be heard, and lightning strikes you immediately.",

            "You disintegrated into dust.",

            "Yet, from your place of death, the roots began forming.",

            "The root tangled together until it was firm and coated the outer layer with a substance.", "As it went on, it began making a humanoid shape.", "And as the coat covered the surface, it began forming into \"you.\"", 

            "With the uppermost covered by a substance, the humanoid morphed into you."],

            "Me": "Once again, I’m alive."
        },
        {
            "Narrator": ["You resurrected in a second.",

            "The root mage screamed with a terrorizing cry, and summoned four root creatures."],

            "Me": "Come on, now. That’s just too OP."
        },
        {
            "Narrator": ["You gripped on your blade and charged towards the root creatures.",

            "You approached the creature with two small blades. An agile one.",

            "It immediately slit your neck, killing you in an instant—and you resurrected in an instant.",

            "You dashed towards the agile creature with a shield then stabbed it with the blade.",

            "Then, a bulky root creature slammed a sword on you and cut you into two pieces—but the roots resurrected you immediately and attached your split body.",

            "The bulky creature’s sword just reached the ground. You stepped on the sword then stabbed the creature.",

            "As it disintegrated, you heard another thunder, and lightning hit you once again.",

            "You resurrected in an instant and gasped for breath."],
            
            "Me": "You nasty bastard. What a spammer."
        },
        {
            "Narrator": "Afterwards, the mage summoned another four, even though one root creature still remained.",

            "Me": "This is too much…"
        }
    ]
}